infrastructure/experiments/haproxy-planner/leastconn-2/ab_100_10.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.2 (be patient).....done


Server Software:        PIB
Server Hostname:        192.168.0.2
Server Port:            8080

Document Path:          /
Document Length:        2708 bytes

Concurrency Level:      10
Time taken for tests:   0.268 seconds
Complete requests:      100
Failed requests:        89
   (Connect: 0, Receive: 0, Length: 89, Exceptions: 0)
Total transferred:      288096 bytes
HTML transferred:       269896 bytes
Requests per second:    372.77 [#/sec] (mean)
Time per request:       26.826 [ms] (mean)
Time per request:       2.683 [ms] (mean, across all concurrent requests)
Transfer rate:          1048.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.2      1       2
Processing:    10   24  10.3     21      61
Waiting:       10   23  10.2     20      60
Total:         11   25  10.3     22      62

Percentage of the requests served within a certain time (ms)
  50%     22
  66%     27
  75%     32
  80%     34
  90%     39
  95%     44
  98%     58
  99%     62
 100%     62 (longest request)
